/**小学高年级4-6年级 语文各个项目的评价和建议 */
var yw_high = new Map([
['基础知识',{appraise:{
    "A":"你的基础知识掌握得非常扎实，对书本中学到的知识也能举一反三，灵活运用，潜力无限！",
    "B":"你的基础知识掌握得比较扎实，对书本中学过的知识有一定的运用能力，继续加油！",
    "C":"你的基础知识掌握得一般，在知识的积累和运用上还需要多多努力。"
},
suggest:{
    "A":"在基础知识方面，你可以选择多拓展一些课外的知识，多一些课外的积累，尤其是古诗词及小古文的背诵积累。",
    "B":"在基础知识方面，你要扎扎实实学好书本的内容，适当积累一些课外的拓展知识。",
    "C":"在基础知识方面，希望你能反复巩固书本中的知识，勤学勤练，多积累。"
}}],
['阅读理解',{appraise:{
    "A":"你能很好地理解文本，综合运用能力很不错，尤其在提取、整合和梳理信息的能力上特别突出，继续保持！",
    "B":"你能比较好地理解文本，具有一定的综合运用能力。在思维和创新能力的提升上可以再多努力哟！",
    "C":"你对文本的理解尚可，要注意信息提取、整合和梳理的能力，期待你更大的进步！"
},
suggest:{
    "A":"在阅读训练中，你可以积极拓展课外阅读训练；多看好书，拓展阅读面，积累阅读量，尤其是小古文和古诗词的积累。",
    "B":"在阅读训练中，在巩固课内阅读训练的同时，适当拓展课外阅读，积累阅读量。",
    "C":"在阅读训练中，请你多多关注课内阅读，提高课堂听课效率，这样才能更好地理解文本。"
}}],
['习作',{appraise:{
    "A":"你有非常棒的语言表达能力，不但能把自己的所思所想完整表达出来，还能写清楚、写具体，是一个优秀的“小作家”。",
    "B":"你有比较好的语言表达能力，能把自己的想法写清楚，写完整，如果能写得再具体一些会更好，加油！",
    "C":"你的语言表达能力一般，要注意语句表达的通顺和文章结构的完整，希望你能勤思勤练，争取进步！"
},
suggest:{
    "A":"在写话方面你已经非常棒啦！请保持好的阅读习惯，多看书多积累。",
    "B":"在写话方面你请你保持好的阅读习惯，多看书，多积累，勤动笔。",
    "C":"在写话方面，你平时要注意积累，多加练习，减少错别字和病句。"
}}]])

/**小学高年级4-6年级 数学各个项目的评价和建议 */
var sx_high = new Map([
    ['基础知识',{appraise:{
        "A":"你对基础知识掌握的很全面，你在数学抽象、数学建模、直观想象方面很优秀，你很扎实，是个认真、踏实会学习的孩子。",
        "B":"你对基础知识掌握的不是很扎实，你在数学抽象、数学建模、直观想象方面还需要努力，努力变成一个认真、踏实会学习的孩子吧。",
        "C":"你对基础知识掌握的很不理想，你在数学抽象、数学建模、直观想象方面还需要进一步的学习。"
    },
    suggest:{
        "A":"基础的学习一定不能满足不了你了，试着多去尝试一些自己感兴趣、更深层次的数学领域吧！老师看好你！",
        "B":"试着多去分析、推理问题，思考的更加全面一些，相信你一定会有自己的收获。",
        "C":"学好基础知识并没有想象中那么困难，让每一节课、每一次作业来帮你吧，从这每一次中你一定找到你所需要的。"
    }}],
    ['基本计算',{appraise:{
        "A":"数学运算是学习数学的重要基础，你在这方面正确率很高，算理明确、计算细心，这是很难得的，你太优秀了。",
        "B":"数学运算是学习数学的重要基础，你的运算能力还需要进一步提高。",
        "C":"数学运算是学习数学的重要基础，你在这方面的学习还需要继续加强。"
    },
    suggest:{
        "A":"持之以恒的计算练习能让你保持大脑的清醒，更能帮助你在数学学习中提供保障，继续加油吧！",
        "B":"持之以恒的计算练习能让你保持大脑的清醒，更能帮助你在数学学习中提供保障，试着让计算练习成为你日常的一部分吧。",
        "C":"持之以恒的计算练习能让你保持大脑的清醒，更能帮助你在数学学习中提供保障，明确算理、细心计算，才能提高正确率，试着让计算练习成为你日常的一部分吧，相信自己一定能做到！"
    }}],
    ['问题解决',{appraise:{
        "A":"问题解决是数学学习的核心能力，你在这方面很优秀，相信你在逻辑推理、数据分析方面也一定有自己独特的见解，你真是个数学学习小能手。",
        "B":"问题解决是数学学习的核心能力，你在这方面还可以再提升一些。",
        "C":"问题解决是数学学习的核心能力，你在这方面还需要更深一步的学习。"
    },
    suggest:{
        "A":"解决了试卷上问题的你一定不会满足，多多发现、分析生活中的实际问题吧，相信你一定会用数学为身边的人提供帮助的！",
        "B":"你可以在逻辑推理、数据分析方面下功夫，多多观察、学会分析，相信你一定会有所收获。",
        "C":"书本上的知识最终会帮助我们解决一个又一个的实际问题，将知识学扎实，生活中做一个善于观察、勇于分析的孩子吧。"
    }}]])

    /**小学高年级4-6年级 英语各个项目的评价和建议 */
var yy_high = new Map([
    ['读写',{appraise:{
        "A":"能在图片的帮助下读懂小故事并抓住大意。能初步使用简单的工具书。能用短语或句子描述系列图片，编写简单的故事。",
        "B":"能掌握规定的词汇，句型及语法知识，能养成按意群阅读的习惯。能够写出简单的问候语。",
        "C":"能根据要求为图片写出简短的标题或描述。能看懂贺卡等所表达的简单信息。"
    },
    suggest:{
        "A":"若能根据作业要求主动收集信息、查阅信息、处理信息、以不同形式呈现信息就能大踏步前进了！",
        "B":"若能积极主动地思考，对老师提出的问题经常主动回答就能收获更多！",
        "C":"若能积极参与课堂学习活动，在小组活动中与其他同学积极配合和合作，就能稳步前进了！"
    }}],
    ['听力',{appraise:{
        "A":"能识别不同句式的语调，如陈述句，疑问句和指令等。能根据语调变化，判断句子意义的变化。能识别语段中句子间的联系。能听懂有关熟悉话题的语段。",
        "B":"能听懂简单的话语或录音材料。能听懂简单的配图小故事。能听懂课堂活动中简单的提问。能听懂常用指令和要求并做出适当反应。",
        "C":"能听懂课堂简短的指令并做出相应的反应。能根据指令做事情，如：指图片，涂颜色，画图，做动作，做手工等。能在图片和动作的提示下听懂简单的小故事并做出反应。"
    },
    suggest:{
        "A":"若能坚持蓝思系统或纸质故事阅读，不断提升语感，就能厚积薄发，达到新的高度。",
        "B":"若能尝试阅读课外英语故事，初步使用简单的英汉词典，就能大踏步前进了！",
        "C":"若能认真跟读示范录音，尽可能读音与录音中的语音语调保持一致就能慢慢练出一双灵敏的耳朵。"
    }}],
    ['口语',{appraise:{
        "A":"能正确朗读所学故事或短文。能在情景中灵活运用语言材料进行交流。",
        "B":"语音、语调基本正确，吐字清晰。能互致问候 ，交换有关个人家庭和朋友的信息。能根据所学内容表演小对话或歌谣。",
        "C":"能认读所学词语，能根据拼读规则，读出简单的词语，能读懂教材中简短的要求和指令。"
    },
    suggest:{
        "A":"若能参加课本剧表演、英语校内外竞赛就锦上添花了！",
        "B":"若能制定简单的英语学习计划，课堂中积极运用所学进行表达和交流就锦上添花了！",
        "C":"若能不怕出错，敢于开口，积极参与课堂学习活动，遇到困难时主动请教，就能体会到更多的乐趣。"
    }}]])

        /**小学高年级4-6年级 科学各个项目的评价和建议 */
var kx_high = new Map([
    ['基础知识',{appraise:{
        "A":"科学概念掌握熟练，能够运用基本科学概念解决生活中的实际问题。",
        "B":"科学基础知识比较扎实，能够较清楚的表述基本的科学现象和概念。",
        "C":"科学基础知识掌握不够到位，不能清晰表达出基本的科学概念。",
        "D":"科学基础知识薄弱，科学概念混淆。"
    },
    suggest:{
        "A":"再接再厉，理论联系实际，学以致用。",
        "B":"学会建立概念之间的联系，及时强化易错知识点。",
        "C":"先从巩固基本概念入手，努力夯实基础知识，及时解决遇到的困惑。",
        "D":"熟记教材的重点知识，摘录学习笔记，及时询问不理解的概念。"
    }}],
    ['实验探究',{appraise:{
        "A":"实验探究能力强，小组合作分工明确，实验操作规范标准，实验现象明显，能根据实验现象得出实验结论。",
        "B":"实验探究能力有待提升，分工明确，实验操作较为规范。",
        "C":"实验探究能力比较欠缺，小组分工模糊，合作意识淡薄。",
        "D":"实验探究能力弱，无分工合作意识，不能完成实验探究过程，操作不规范。"
    },
    suggest:{
        "A":"再接再厉，理论联系实际，学以致用，能自主设计实验探究相关问题。",
        "B":"学会举一反三，强化知识之间的内在联系。",
        "C":"需要深入理解实验探究的现象和本质之间的逻辑关系，加强合作意识，明确实验仪器的使用和注意事项。",
        "D":"多体验生活中的科学，亲历科学实证过程，建立科学探究合作意识，树立吃苦耐劳的学习品质，不断完善实验操作规范。"
    }}]])


/**德育小学高年级评价与建议 */
var morals = new Map([
    ['时间观念',{appraise:{
        "A":"你很有时间观念，上学、上课从不迟到。还能提前做好课前准备，真棒！",
        "B":"你有时间观念，上学、上课不迟到。如果能提前做好好课前准备，就更好了。",
        "C":"你偶尔会有迟到现象，请注意自己的时间观念哦。还要学会提前做好课前准备。",
        "D":"你经常上课、上学迟到，缺乏时间观念的你，真的要改变了。"
    }}],
    ['作业完成',{appraise:{
        "A":"你能独立完成作业，按时上交，有错误还能时订正，值得表扬。",
        "B":"你能独立完成作业，按时上交。但是有时候会忘记订正，尤其是自己的相对薄弱的学科。要注意哦。",
        "C":"你做作业的时候，总喜欢“问”。不懂就问没错，只是你要学会独立思考，确定实在不会再去“问”，好吗？",
        "D":"你不能独立完成作业，有时候还会拖欠作业，订正不及时。这样的状态有点糟糕了。请赶紧调整。"
    }}],
    ['课堂规范',{appraise:{
        "A":"课堂上，你会倾听、会思考、很分享，真赞！",
        "B":"课堂上，你专注听讲，也会思考，如果能够乐于表达，那就更好了。",
        "C":"课堂上，你能做到专注听讲，如果能多多思考，乐于分享，那就更赞了。",
        "D":"课堂上，你经常需要老师提醒坐端正，偶尔还会做小动作。学会专注倾听，你必须努力了。"
    }}],
    ['文明礼仪',{appraise:{
        "A":"彬彬有礼的你，看到老师、同学会微笑，并有礼貌地问好，语言文明。赞一个！",
        "B":"你是一个彬彬有礼的孩子，看到老师、同学会微笑。只是有点害羞，要学会主动“问好”。",
        "C":"你看到老师、同学会问好。但是如果能慢下脚步，面带微笑就会显得更加彬彬有礼。如果将某些不太文明的“网络语言”戒掉，那就更好了。",
        "D":"你有时候表现得不是很有礼貌，看到老师、同学会面无表情，也不问好。有时候语言也不文明，这样的你，你喜欢吗？"
    }}],
    ['集体活动',{appraise:{
        "A":"你出操、列队、都能做到静、快、齐。运动时充满朝气，很好！",
        "B":"你出操、列队、都能做到静、快、齐。但是运动的时候表现得有点“软绵绵”，精神状态不够好。加油！",
        "C":"你出操、列队，喜欢讲话，队伍不整齐，请改正。",
        "D":"你出操、列队，喜欢讲话，队伍不整齐，运动的时候也是懒懒散散，提出批评。请尽快调整。"
    }}],
    ['卫生习惯',{appraise:{
        "A":"你注意个人卫生的同时，能维护好班级的卫生。真赞！",
        "B":"你的个人卫生习惯比较好。但是班级主人翁精神还缺乏。做班级的“主人”吧！",
        "C":"你爱劳动，班级打扫很积极。只是个人物品摆放、还有个人卫生需要加强。加油。",
        "D":"你的学号常因为“卫生习惯”问题“亮相”在白板上。希望你培养个人卫生习惯的同时，学会维护好班级的卫生。"
    }}]
])


/**实践创新小学高年级评价与建议 */
var sjcx = new Map([
    ['感知力',{appraise:{
        "A":"你真像个小太阳，温暖了自己，也照耀了别人。无论是在成长联盟活动中，还是在社会实践活动中。感恩成为了你的习惯，你在实践中获得的真知，珍贵无比。",
        "B":"公益活动中有你的身影，实践活动中有你的汗水，踏实是你的标签，但自我成长还需磨砺，如果你能把你身上的能量辐射给身边的同学们，那就更好了。",
        "C":"各项实践活动中，很难看到你的身影，真的很遗憾。所以你也很难感受到活动中的快乐和收获。从现在开始，跨出“一步”，和同学们一起“立爱自亲始”、“实践出真知”。"
    }}],
    ['学习力',{appraise:{
        "A":"你身上有着令人惊叹的学习力。你对所有未知充满了强烈的探究欲望，并能积极乐观的解决遇到的问题，所以在实践中活动中，你总能成为“方向”。",
        "B":"你对周围的一切拥有足够的好奇心，偶尔能看到你去主动地思考，多希望瞬间产生的疑惑能成为你探索的“动力”。",
        "C":"你只是在活动，常常是“被安排”和“被分配”，所以很多时候会觉得无趣。如果，你想改变这样的状态，从“主动”开始。 "
    }}],
    ['意志力',{appraise:{
        "A":"你是同学们心目中的“标杆人物”：勇敢、明理、纪律与规范、责任与担当，你不但自己做到了，还能以这样的“正能量”带领同学们一起前行。",
        "B":"完成任务是你的目标。如果少一些“任务意识”，变成主动的“我想……”，那你会有更大的收获。期待你更果敢、更坚韧。",
        "C":"你最强劲的“对手”是自己，希望你朝着“坚强、坚韧、坚持”的目标迈进。"
    }}]
])



/**国际理解小学高年级评价与建议 */
var gjlj = new Map([
    ['语言能力',{appraise:{
        "A":"你有很强的语言表现，能流利地运用多种语言进行沟通和交流，表达精确、自然、纯正。你具有较强的听力、理解能力、阅读理解能力、口语表达能力、书面表达能力，能灵活使用语言过程中涉及的一些策略。你具备较丰富的语法知识、语篇知识、功能知识和社会语言知识。",
        "B":"你对语言表现出比较积极的态度和兴趣， 愿意主动倾听获得的信息。在给定的话题和真实交际情景中，可以运用中等难度的句子与词汇进行自我表达，并体现一定的语言素养。比较适应不同社会和不同语境的互动与交流. 有拓展自身知识储备的意识。",
        "C":"你能理解日常生活中十分熟悉的简单语言材料，识别相关活动或身边事物的基本信息，理解基本词语的含义。能用基本的、简短的话语与他人交流，互致问候，相互介绍或陈述身边事物的基本信息，以及表现态度。你有时会借助重复、手势、表情等非言语手段进行交流。"
    },
    suggest:{
        "A":"希望你继续拓展表达空间，通过参与语言类活动，课程以及标准化考试等，实践和积累语料，培养良好的语感，进一步提升自己的表达、倾听和理解能力。在任务和真实情景中，提升自己的对外社交沟通素养。",
        "B":"希望你积极参与语言类活动，课程以及语言标准化考试，在阅读、口语训练和交流活动中充分调动认知过程，进一步提升自己的语言综合运用能力和素养。同时学会搜集、选择、归纳、整理语料信息的方法和能力。",
        "C":"通过参与语言类活动，课程以及标准化考试，反复背单词，认真精读，积极背诵来锻造扎实语言功底。用简单的英文解释有效的探究问题，有意识的用外语收集、处理和使用信息。更加大胆地用英文分享、讨论和评价想法和总结。"
    }}],
    ['实践能力',{appraise:{
        "A":"你有优秀的跨文化素养、全球意识，外语能力以及国际礼仪与技能。能够大方得体地与国际友人进行交流与沟通。通过国际理解课程、参观访问、交流访学等活动，初步形成自己的多元文化的价值观。你能够从全球观来看待事情，尊重不同于自己的种族、阶层、性别与文化。你有一定的社会责任感和民族自豪感。",
        "B":"你具备一定的跨文化素养、全球意识，外语能力以及国际礼仪与技能。能够与国际友人进行基本的交流与沟通。通过亲亲国际理解课程、参观访问、交流访学等活动，基本认知自我，愿意学习并接纳世界多元文化，懂得关爱。",
        "C":"能够与国际友人进行基本的交流与沟通。通过亲亲国际理解课程、参观访问、交流访学等活动中；能够基本尊重不同种族、不同宗教信仰和不同区域、国家、地区的差异性，具备有一定的国际视野。 "
    },
    suggest:{
        "A":"要善于通过自主探究性学习进一步开阔自身的国际视野，提升自主解决问题的意识和能力，世界情怀，不断激发自己探索世界激情。要基于已有知识和经验开展探究，不断拓展超越事实的知识。",
        "B":"更加积极参加各类国际理解类的理论和实践课程，提升自信心，开阔国际视野，树立世界情怀，激发探索世界的欲望。继续提高搜集信息的能力，主动了解国际社会的热点问题，关注国际社会的和平与发展。能形成对国际社会热点问题的思辨能力、价值判断并能在深度讨论的基础上形成自己的独特见解。",
        "C":"要更加积极主动参与国际理解类的理论和实践课程，进一步了解世界，感受多元文化的魅力，培养对非母语语言的兴趣。培养全球视野，提高自身运用国际交流语言的能力与国际交往等方面的综合能力。"
    }}]
])

